---
kind: property
id: P:Autodesk.Revit.DB.Macros.MacroModule.MacroManager
source: html/27324968-a822-dda4-c8ea-31ce7593fd8a.htm
---
# Autodesk.Revit.DB.Macros.MacroModule.MacroManager Property

The Macro manager.

## Syntax (C#)
```csharp
public MacroManager MacroManager { get; }
```